contrib/load/test_result_scenario_2_before.txt
Using hey at: /opt/homebrew/bin/hey
Server address: http://localhost:8080

  === Running Scenario 2: Fill database with random metrics ===
  === then batch upload of 5 counters and 5 gauges ===

Filling database with random metrics...
Progress: 0/1000
Progress: 100/1000
Progress: 200/1000
Progress: 300/1000
Progress: 400/1000
Progress: 500/1000
Progress: 600/1000
Progress: 700/1000
Progress: 800/1000
Progress: 900/1000
Starting load test...

Summary:
  Total:        30.0016 secs
  Slowest:      0.0490 secs
  Fastest:      0.0002 secs
  Average:      0.0022 secs
  Requests/sec: 4634.6822


Response time histogram:
  0.000 [1]     |
  0.005 [131137]        |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.010 [7266]  |■■
  0.015 [398]   |
  0.020 [122]   |
  0.025 [74]    |
  0.029 [26]    |
  0.034 [10]    |
  0.039 [8]     |
  0.044 [4]     |
  0.049 [2]     |


Latency distribution:
  10% in 0.0005 secs
  25% in 0.0009 secs
  50% in 0.0018 secs
  75% in 0.0029 secs
  90% in 0.0042 secs
  95% in 0.0053 secs
  99% in 0.0075 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0002 secs, 0.0490 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0011 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0013 secs
  resp wait:    0.0021 secs, 0.0002 secs, 0.0490 secs
  resp read:    0.0000 secs, 0.0000 secs, 0.0113 secs

Status code distribution:
  [200] 139048 responses